import torch


# 1.4.2_stack函数使用.py
def test01():

   torch.manual_seed(0)
   data1 = torch.randint(0,10,[2, 3])
   data2 = torch.randint(0,10,[2, 3])
   print(data1)
   print(data1.shape)
   print("---------------------------------------------------------------------------------------------------------")
   print(data2)

   print("---------------------------------------------------------------------------------------------------------")
   # 将两个张量stack 起来，象cat 一样，只是stack 函数会增加一个维度
   # 1. 按照0维度进行拼接
   new_date =  torch.stack([data1, data2], dim=0)
   print(new_date)
   print(new_date.shape)
   print("----------------------------------------------以下按1维度-----------------------------------------------------------")
   # 2. 按照1维度进行拼接
   new_data = torch.stack([data1, data2], dim=1)
   print(new_data)
   print(new_data.shape)
   print("---------------------------------------------------------------------------------------------------------")
   print("----------------------------------------------以下按2 维度-----------------------------------------------------------")
   # 3. 按照2维度进行拼接
   new_data = torch.stack([data1, data2], dim=2)
   print(new_data)
   print(new_data.shape)
   print("---------------------------------------------------------------------------------------------------------")
if __name__ == '__main__':
    test01()
