"""
1. squeeze() —— 压缩维度

作用：默认去掉 大小为 1 的维度。

2. unsqueeze() —— 增加维度

作用：在指定位置增加一个 大小为 1 的维度。

"""

import torch


# 1.squeeze()的使用
"""
    压缩维度

"""
def test01():
   torch.manual_seed(0)
   data = torch.randint(0,10,[1, 3, 1, 5])
   print(data)
   print(data.shape)
   print("---------------------------------------------------------------------------------------------------------")
   # 压缩维度， 默认压缩维度为 1
   new_data = data.squeeze()
   print(new_data)
   print(new_data.shape)
   print("---------------------------------------压缩指定维度------------------------------------------------------------------")
   # 压缩指定维度， 0
   new_data = data.squeeze(0)
   print(new_data)
   print(new_data.shape)
   print("---------------------------------------压缩指定维度------------------------------------------------------------------")



# 2. unsqueeze()的使用

def test02():

    torch.manual_seed(0)
    data = torch.randint(0,10,[2, 3])
    print(data)
    print(data.shape)
    print("---------------------------------------------------------------------------------------------------------")
   # 增加维度， 必须指定维度  ， -1 表示增加在最后一个维度
    new_data = data.unsqueeze(1)
    print(new_data)
    print(new_data.shape)
    print("--------------------------------------- 增加指定维度------------------------------------------------------------------")



if __name__ == '__main__':
    test02()